Autodesk.Revit.DB.ModelPathUtils.CloudRegionEMEA
The name of cloud region EMEA.
Since:
2021

Autodesk.Revit.DB.ModelPathUtils.CloudRegionUS
The name of cloud region US.
Since:
2021

Autodesk.Revit.DB.ModelPathUtils.HashDocumentPathName(Autodesk.Revit.DB.Document)
Hash of document's path name by removing private information
Once hashed it can be used for logging. E.g send to analytics
aDoc:
The document whose path name is to be hashed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ModelPathUtils.IsValidFileName(System.String)
Checks that the file name does not contain
any invalid characters.
fileName:
The file name to check.
Returns:
True if the file name is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ModelPathUtils.ConvertCloudGUIDsToCloudPath(System.String,System.Guid,System.Guid)
Converts a pair of cloud project and model GUIDs to a valid cloud path.
region:
The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model.
Please see the reference values, like Autodesk.Revit.DB.ModelPathUtils.CloudRegionUS and Autodesk.Revit.DB.ModelPathUtils.CloudRegionEMEA,
and the new regions from release note.
projectGuid:
The GUID of the cloud project which contains the model.
modelGuid:
The GUID of the Revit cloud model.
Returns:
The cloud model path.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelException:
The cloud project is missing.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The central server could not be reached.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
You must sign in to Autodesk 360 in order to complete action.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You are unauthorized to access this resource.
Since:
2021

Autodesk.Revit.DB.ModelPathUtils.ConvertModelPathToUserVisiblePath(Autodesk.Revit.DB.ModelPath)
Gets a string version of the path of a given ModelPath.
path:
A ModelPath representing a file path or a server path.
Returns:
The path in string form
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ModelPathUtils.ConvertUserVisiblePathToModelPath(System.String)
Converts a user-visible path (string) to a ModelPath.
Remarks:
The path may be a server or file path.
strPath:
The path in string form, like RSN://{HostNodeName}/school/project.rvt
Returns:
A ModelPath representing either a server or file path.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ModelPathUtils.IsValidUserVisibleFullServerPath(System.String)
Determines whether the given string represents a valid
server path.
Remarks:
ServerPaths must refer to Revit models.
ServerPaths are relative to the central server location, and
are of the form "RSN://{HostNodeName}/{model_path}".
The {model_path}
portion is a relative path to a Revit model. For example:
RSN://EXS/hospital.rvt
RSN://EXS.autodesk.com/Old Files/hotel2.rvt
RSN://EXS.autodesk.com/Old Files/Last Week/Tuesday\hotel2.rvt
are all valid server paths.
//EXS/Old Files/.rvtEXS/hospital
are not valid server paths.
If this function returns false, it does not necessarily mean
the given path is a file path. It may be a malformed string.
strPath:
The path, in string form
Returns:
True if the given path is a valid server path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012